app/controllers/articles_controller.rb

INSERT INTO "articles" ("text", "author", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["text", "test text"], ["author", "Greg"], ["created_at", "2016-01-21 03:32:48.352845"], ["updated_at", "2016-01-21 03:32:48.352845"]]
---
  def create
    @article = Article.create(article_params)